import os
import time


def j_d(j, noo, kbs, tie, xk, mine):
    print(f"          -----你好 {name.upper()} 欢迎来到此游戏!-----     \n     ")
    print(f'''                 -----玩家 {name.title()}-----               
          姓名：{name.title()}
          年龄：{age}
          玩家状态：  已成年  
          系统状态：准备中... 
                   预计--17.5--秒后准备完毕\n''')
    print("-------------------------------------------------------------------")
    print(f'''     加载中...
             |{j}| {noo} MB {kbs} kB/s 还需： {tie}
              共 {xk} MB''')
    time.sleep(mine)
    os.system("clear")


print("\n\n\n   -----实名认证-----   ")
name = input("请输入你的名字:").strip()
age = int(input("请输入你的年龄:"))
while age <= 0:
    os.system("clear")
    print(f"请输入你的名字:{name}")
    print("\n----------- 输入错误! -----------")
    age = int(input("请输入你的年龄:"))
    if age > 0:
        break
os.system("clear")
time.sleep(0.1)
if age <= 17:
    print("你还未成年！3秒后将为您自动退出游戏！")
    time.sleep(3)
    exit()
elif age >= 18:
    j_d(" " * 20, 0, 0.4, "0:20:26", 10, 1.75)
    j_d("▌" * 1 + " " * 19, 1, 6.1, "0:18:94", 10, 1.75)
    j_d("█" * 1 + " " * 19, 1, 2.4, "0:13:54", 10, 1.75)
    j_d("█" * 2 + " " * 18, 2, 8.4, "0:6:14", 10, 1.75)
    j_d("█" * 3 + " " * 17, 2, 9.5, "0:4:07", 10, 1.75)
    j_d("█" * 4 + " " * 16, 4, 1.4, "0:16:49", 10, 1.75)
    j_d("█" * 9 + " " * 11, 4, 14.9, "0:2:33", 10, 1.75)
    j_d("█" * 10 + " " * 10, 5, 2.4, "0:11:05", 10, 1.75)
    j_d("█" * 18 + " " * 2, 9, 27.3, "0:00:03", 10, 1.75)
    j_d("█" * 20, 10, 0.0, "0:00:00", 10, 1.75)
    time.sleep(17.5)
    os.system("clear")
